ahtn/keyplus/ports/efm8/efm8/mcu/C8051F336/inc/SI_C8051F336_Register_Enums.h
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// OSCICL Enums (High Frequency Oscillator Calibration @ 0xB3)
//------------------------------------------------------------------------------
#define OSCICL_OSCICL__FMASK 0x7F ///< Internal Oscillator Calibration
#define OSCICL_OSCICL__SHIFT 0x00 ///< Internal Oscillator Calibration
                                                                      
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0xB2)
//------------------------------------------------------------------------------
#define OSCICN_IFCN__FMASK       0x03 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__SHIFT       0x00 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__HFOSC_DIV_8 0x00 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 8.                                    
#define OSCICN_IFCN__HFOSC_DIV_4 0x01 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 4.                                    
#define OSCICN_IFCN__HFOSC_DIV_2 0x02 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 2.                                    
#define OSCICN_IFCN__HFOSC_DIV_1 0x03 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 1.                                    
                                                                                            
#define OSCICN_STSYNC__BMASK     0x10 ///< Suspend Timer Synchronization                    
#define OSCICN_STSYNC__SHIFT     0x04 ///< Suspend Timer Synchronization                    
#define OSCICN_STSYNC__NOT_SET   0x00 ///< It is safe to read and write the suspend timer   
                                      ///< registers.                                       
#define OSCICN_STSYNC__SET       0x10 ///< Reads and writes of the suspend timer register   
                                      ///< should not be performed.                         
                                                                                            
#define OSCICN_SUSPEND__BMASK    0x20 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__SHIFT    0x05 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__DISABLED 0x00 ///< The internal oscillator is not in suspend mode.  
#define OSCICN_SUSPEND__ENABLED  0x20 ///< Place the internal oscillator in suspend mode.   
                                                                                            
#define OSCICN_IFRDY__BMASK      0x40 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__SHIFT      0x06 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__NOT_SET    0x00 ///< The Internal High Frequency Oscillator is not    
                                      ///< running at the programmed frequency.             
#define OSCICN_IFRDY__SET        0x40 ///< The Internal High Frequency Oscillator is running
                                      ///< at the programmed frequency.                     
                                                                                            
#define OSCICN_IOSCEN__BMASK     0x80 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__SHIFT     0x07 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__DISABLED  0x00 ///< Disable the High Frequency Oscillator.           
#define OSCICN_IOSCEN__ENABLED   0x80 ///< Enable the High Frequency Oscillator.            
                                                                                            
//------------------------------------------------------------------------------
// IDA0CN Enums (IDAC0 Control @ 0xB9)
//------------------------------------------------------------------------------
#define IDA0CN_IDAOMD__FMASK              0x03 ///< Output Mode Select                           
#define IDA0CN_IDAOMD__SHIFT              0x00 ///< Output Mode Select                           
#define IDA0CN_IDAOMD__0P5_MA             0x00 ///< 0.5 mA full-scale output current.            
#define IDA0CN_IDAOMD__1_MA               0x01 ///< 1.0 mA full-scale output current.            
#define IDA0CN_IDAOMD__2_MA               0x02 ///< 2.0 mA full-scale output current.            
                                                                                                 
#define IDA0CN_IDACM__FMASK               0x70 ///< Update Source Select                         
#define IDA0CN_IDACM__SHIFT               0x04 ///< Update Source Select                         
#define IDA0CN_IDACM__TIMER0              0x00 ///< DAC output updates on Timer 0 overflow.      
#define IDA0CN_IDACM__TIMER1              0x10 ///< DAC output updates on Timer 1 overflow.      
#define IDA0CN_IDACM__TIMER2              0x20 ///< DAC output updates on Timer 2 overflow.      
#define IDA0CN_IDACM__TIMER3              0x30 ///< DAC output updates on Timer 3 overflow.      
#define IDA0CN_IDACM__CNVSTR_RISING_EDGE  0x40 ///< DAC output updates on rising edge of CNVSTR. 
#define IDA0CN_IDACM__CNVSTR_FALLING_EDGE 0x50 ///< DAC output updates on falling edge of CNVSTR.
#define IDA0CN_IDACM__CNVSTR_ANY_EDGE     0x60 ///< DAC output updates on any edge of CNVSTR.    
#define IDA0CN_IDACM__IDA0H               0x70 ///< DAC output updates on write to IDA0H.        
                                                                                                 
#define IDA0CN_IDAEN__BMASK               0x80 ///< IDAC Enable                                  
#define IDA0CN_IDAEN__SHIFT               0x07 ///< IDAC Enable                                  
#define IDA0CN_IDAEN__DISABLED            0x00 ///< Disable IDAC0.                               
#define IDA0CN_IDAEN__ENABLED             0x80 ///< Enable IDAC0.                                
                                                                                                 
//------------------------------------------------------------------------------
// IDA0H Enums (IDAC0 Data High Byte @ 0x97)
//------------------------------------------------------------------------------
#define IDA0H_IDA0__FMASK 0xFF ///< IDAC0 Data High
#define IDA0H_IDA0__SHIFT 0x00 ///< IDAC0 Data High
                                                   
//------------------------------------------------------------------------------
// IDA0L Enums (IDAC0 Data Low Byte @ 0x96)
//------------------------------------------------------------------------------
#define IDA0L_IDA0__FMASK 0xC0 ///< IDA0 Data Low
#define IDA0L_IDA0__SHIFT 0x06 ///< IDA0 Data Low
                                                 
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_EMAT__BMASK      0x02 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__SHIFT      0x01 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.                
#define EIE1_EMAT__ENABLED    0x02 ///< Enable interrupt requests generated by a Port     
                                   ///< Match.                                            
                                                                                          
