ahtn/keyplus/ports/efm8/efm8/mcu/C8051F336/inc/SI_C8051F336_Register_Enums.h
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0.
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                
                                                                                               
#define SCON0_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON0_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON0_RB8__CLEARED_TO_0     0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON0_RB8__SET_TO_1         0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON0_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON0_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON0_TB8__CLEARED_TO_0     0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON0_TB8__SET_TO_1         0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                        
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                         
                                                                                               
#define SCON0_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON0_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON0_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON0_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// VDM0CN Enums (VDD Supply Monitor Control @ 0xFF)
//------------------------------------------------------------------------------
#define VDM0CN_VDDSTAT__BMASK     0x40 ///< VDD Status                                   
#define VDM0CN_VDDSTAT__SHIFT     0x06 ///< VDD Status                                   
#define VDM0CN_VDDSTAT__VDD_BELOW 0x00 ///< VDD is at or below the VDD monitor threshold.
#define VDM0CN_VDDSTAT__VDD_ABOVE 0x40 ///< VDD is above the VDD monitor threshold.      
                                                                                         
#define VDM0CN_VDMEN__BMASK       0x80 ///< VDD Monitor Enable                           
#define VDM0CN_VDMEN__SHIFT       0x07 ///< VDD Monitor Enable                           
#define VDM0CN_VDMEN__DISABLED    0x00 ///< Disable the VDD Monitor.                     
#define VDM0CN_VDMEN__ENABLED     0x80 ///< Enable the VDD Monitor.                      
                                                                                         
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_REFBE__BMASK    0x01 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__SHIFT    0x00 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__DISABLED 0x00 ///< Disable the internal reference buffer.            
#define REF0CN_REFBE__ENABLED  0x01 ///< Enable the internal reference buffer. The internal
                                    ///< voltage reference is driven on the VREF pin.      
                                                                                           
#define REF0CN_BIASE__BMASK    0x02 ///< Internal Analog Bias Generator Enable             
#define REF0CN_BIASE__SHIFT    0x01 ///< Internal Analog Bias Generator Enable             
#define REF0CN_BIASE__DISABLED 0x00 ///< Disable the internal bias generator.              
#define REF0CN_BIASE__ENABLED  0x02 ///< Enable the internal bias generator.               
                                                                                           
#define REF0CN_TEMPE__BMASK    0x04 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__SHIFT    0x02 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__DISABLED 0x00 ///< Disable the internal Temperature Sensor.          
#define REF0CN_TEMPE__ENABLED  0x04 ///< Enable the internal Temperature Sensor.           
                                                                                           
#define REF0CN_REFSL__BMASK    0x08 ///< Voltage Reference Select                          
#define REF0CN_REFSL__SHIFT    0x03 ///< Voltage Reference Select                          
#define REF0CN_REFSL__VREF     0x00 ///< Use the VREF pin as the voltage reference.        
#define REF0CN_REFSL__VDD      0x08 ///< Use VDD as the voltage reference.                 
                                                                                           
//------------------------------------------------------------------------------
// EMI0CN Enums (External Memory Interface Control @ 0xAA)
//------------------------------------------------------------------------------
#define EMI0CN_PGSEL__BMASK 0x01 ///< XRAM Page Select
#define EMI0CN_PGSEL__SHIFT 0x00 ///< XRAM Page Select
                                                      
#endif // SI_C8051F336_REGISTER_ENUMS_H
//-eof--------------------------------------------------------------------------

